cf_billing/InformationRegisters/бестИтоговыеЗначенияПараметровСуточнойВедомости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестИтоговыеЗначенияПараметровСуточнойВедомости</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВНР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестВидыПараметровИзмерителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестПараметрыИзмерителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПараметрыИзмерителей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестВидыПараметровИзмерителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасположениеИзмерителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргРасположениеИзмерителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТемпературы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыТемператур</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Измеритель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестПлотностиВоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПлотностиВоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/бестТипыТемператур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестТипыТемператур</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТемператураПодачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТемператураОбратнойСетевойВоды</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/InformationRegisters/бестИтоговыеЗначенияПараметровСуточнойВедомости/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить данные ведомости
//
// Параметры:
//  Организация				 - СправочникСсылка.Организации  
//  ПериодНачисления		 - Дата 
//  Район					 - СправочникСсылка.энргЗоныОтвественности
//  МКД						 - СправочникСсылка.энргСтроения
//  ИсключаяОтдельностоящие	 - Булево 
//  Период					 - Дата 
// 
// Возвращаемое значение:
//   ТаблицаЗначений 
//
Функция ПолучитьДанныеВедомости(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие, Период) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ПриборУчета КАК УзелУчета,
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ВидПараметра КАК ВидПараметра,
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.Шкала КАК Шкала,
		|	бестПараметрыИзмерителейСрезПоследних.ТипТемпературы КАК ТипТемпературы,
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ЗначениеПараметра КАК ЗначениеПараметра,
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ПериодНачисления КАК ПериодНачисления,
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ВНР КАК ВНР
		|ПОМЕСТИТЬ ДанныеСуточнойВедомости
		|ИЗ
		|	РегистрСведений.бестИтоговыеЗначенияПараметровСуточнойВедомости.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И МКД = &МКД
		|				И (ПериодНачисления = &ПериодНачисления
		|					ИЛИ ПериодНачисления = &ПредПериодНачисления)) КАК бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПараметрыИзмерителей.СрезПоследних(&Период, ) КАК бестПараметрыИзмерителейСрезПоследних
		|		ПО бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.Шкала = бестПараметрыИзмерителейСрезПоследних.Шкала
		|			И бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ПриборУчета = бестПараметрыИзмерителейСрезПоследних.Измеритель
		|			И бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ВидПараметра = бестПараметрыИзмерителейСрезПоследних.ВидПараметра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСуточнойВедомости.ОбъектРасчета КАК ОбъектРасчета,
		|	ДанныеСуточнойВедомости.УзелУчета КАК УзелУчета,
		|	ДанныеСуточнойВедомости.ВидПараметра КАК ВидПараметра,
		|	ДанныеСуточнойВедомости.Шкала КАК Шкала,
		|	ДанныеСуточнойВедомости.ЗначениеПараметра КАК ЗначениеПараметра,
		|	ЕСТЬNULL(бестПлотностиВоды.Плотность, 0) КАК ПлотностьПодающейСетевойВоды,
		|	0 КАК ПлотностьОбратнойСетевойВоды,
		|	ДанныеСуточнойВедомости.ПериодНачисления КАК ПериодНачисления,
		|	ДанныеСуточнойВедомости.ВНР КАК ВНР
		|ИЗ
		|	ДанныеСуточнойВедомости КАК ДанныеСуточнойВедомости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПлотностиВоды КАК бестПлотностиВоды
		|		ПО ((ВЫРАЗИТЬ(ДанныеСуточнойВедомости.ЗначениеПараметра КАК ЧИСЛО(10, 1))) = бестПлотностиВоды.Температура)
		|			И (ДанныеСуточнойВедомости.ТипТемпературы = ЗНАЧЕНИЕ(Перечисление.бестТипыТемператур.ТемператураПодачи))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеСуточнойВедомости.ОбъектРасчета,
		|	ДанныеСуточнойВедомости.УзелУчета,
		|	ДанныеСуточнойВедомости.ВидПараметра,
		|	ДанныеСуточнойВедомости.Шкала,
		|	ДанныеСуточнойВедомости.ЗначениеПараметра,
		|	0,
		|	ЕСТЬNULL(бестПлотностиВоды.Плотность, 0),
		|	ДанныеСуточнойВедомости.ПериодНачисления,
		|	ДанныеСуточнойВедомости.ВНР
		|ИЗ
		|	ДанныеСуточнойВедомости КАК ДанныеСуточнойВедомости
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПлотностиВоды КАК бестПлотностиВоды
		|		ПО ((ВЫРАЗИТЬ(ДанныеСуточнойВедомости.ЗначениеПараметра КАК ЧИСЛО(10, 1))) = бестПлотностиВоды.Температура)
		|			И (ДанныеСуточнойВедомости.ТипТемпературы = ЗНАЧЕНИЕ(Перечисление.бестТипыТемператур.ТемператураОбратнойСетевойВоды))";
	
	Запрос.УстановитьПараметр("МКД", 					МКД);
	Запрос.УстановитьПараметр("Организация", 			Организация);
	Запрос.УстановитьПараметр("Период", 				Период);
	Запрос.УстановитьПараметр("ПериодНачисления", 		ПериодНачисления);
	Запрос.УстановитьПараметр("ПредПериодНачисления", 	ДобавитьМесяц(ПериодНачисления, -1));
	Запрос.УстановитьПараметр("Район", 					Район);
	
	Если ИсключаяОтдельностоящие тогда		
		Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"МКД = &МКД","МКД <> &МКД");
	Иначе
		Если МКД = Неопределено Тогда 
			Запрос.Текст 	= СтрЗаменить(Запрос.Текст,"МКД = &МКД","ИСТИНА");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

#КонецОбласти

#КонецЕсли
